Autodesk.Revit.DB.Structure.FabricSheetType.GetWireItem(System.Int32,Autodesk.Revit.DB.Structure.WireDistributionDirection)
Gets the Wire stored in the FabricSheetType at the associated index.
wireIndex:
Item index in the Fabric Sheet
direction:
Wire distribution direction of the inquired item
Returns:
Fabric wire Item
Throws Autodesk.Revit.Exceptions.ArgumentException:
The item index is either less than 0 or greater than or equal to number of items in this FabricSheetType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Fabric Sheet is not Custom
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheetType.IsCustom
Verifies if the type is Custom Fabric Sheet
Returns:
True if Layout is set on Custom and if the wireArr is not null
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheetType.SetLayoutAsCustomPattern(System.Double,System.Double,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.FabricWireItem},System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.FabricWireItem})
Sets the minor and major layout patterns as Custom, while specifying the needed parameters for this pattern.
Remarks:
The following properties are not used for custom fabric sheet type:
- MajorDirectionWireType;
- MinorDirectionWireType;
- MajorSpacing;
- MinorSpacing.
minorStartOverhang:
The distance from the edge of the sheet to the first wire in the minor direction.
majorStartOverhang:
The distance from the edge of the sheet to the first wire in the major direction.
minorFabricWireItems:
The fabric wire items in the minor direction.
majorFabricWireItems:
The fabric wire items in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for minorStartOverhang is not a number
-or-
The given value for majorStartOverhang is not a number
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for minorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for majorStartOverhang must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2018

Autodesk.Revit.DB.Structure.FabricSheetType.SetMinorLayoutAsNumberWithSpacing(System.Double,System.Double,System.Int32,System.Double)
Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern.
overallLength:
The entire length of the wire sheet in the major direction.
majorStartOverhang:
The distance from the edge of the sheet to the first wire in the major direction.
numberOfWires:
The number of wires in the minor direction.
spacing:
The distance between the wires in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallLength is not a number
-or-
The given value for majorStartOverhang is not a number
-or-
numberOfWires must range from 2 to 1000000.
-or-
The given value for spacing is not a number
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallLength must be greater than 0 and no more than 30000 feet.
-or-
The given value for majorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for spacing must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SetMinorLayoutAsFixedNumber(System.Double,System.Double,System.Double,System.Int32)
Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern.
overallLength:
The entire length of the wire sheet in the major direction.
majorStartOverhang:
The distance from the edge of the sheet to the first wire in the major direction.
majorEndOverhang:
The distance from the last wire to the edge of the sheet in the major direction.
numberOfWires:
The number of the wires to set in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallLength is not a number
-or-
The given value for majorStartOverhang is not a number
-or-
The given value for majorEndOverhang is not a number
-or-
numberOfWires must range from 2 to 1000000.
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallLength must be greater than 0 and no more than 30000 feet.
-or-
The given value for majorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for majorEndOverhang must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SetMinorLayoutAsMaximumSpacing(System.Double,System.Double,System.Double,System.Double)
Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern.
overallLength:
The entire length of the wire sheet in the major direction.
majorStartOverhang:
The distance from the edge of the sheet to the first wire in the major direction.
majorEndOverhang:
The distance from the last wire to the edge of the sheet in the major direction.
spacing:
The distance between the wires in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallLength is not a number
-or-
The given value for majorStartOverhang is not a number
-or-
The given value for majorEndOverhang is not a number
-or-
The given value for spacing is not a number
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallLength must be greater than 0 and no more than 30000 feet.
-or-
The given value for majorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for majorEndOverhang must be between 0 and 30000 feet.
-or-
The given value for spacing must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SetMinorLayoutAsActualSpacing(System.Double,System.Double,System.Double)
Sets the minor layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.
overallLength:
The entire length of the wire sheet in the major direction.
majorStartOverhang:
The distance from the edge of the sheet to the first wire in the major direction.
spacing:
The distance between the wires in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallLength is not a number
-or-
The given value for majorStartOverhang is not a number
-or-
The given value for spacing is not a number
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallLength must be greater than 0 and no more than 30000 feet.
-or-
The given value for majorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for spacing must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SetMajorLayoutAsNumberWithSpacing(System.Double,System.Double,System.Int32,System.Double)
Sets the major layout pattern as NumberWithSpacing, while specifying the needed parameters for this pattern.
overallWidth:
The entire width of the wire sheet in the minor direction.
minorStartOverhang:
The distance from the edge of the sheet to the first wire in the minor direction.
numberOfWires:
The number of the wires to set in the major direction.
spacing:
The distance between the wires in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallWidth is not a number
-or-
The given value for minorStartOverhang is not a number
-or-
numberOfWires must range from 2 to 1000000.
-or-
The given value for spacing is not a number
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallWidth must be greater than 0 and no more than 30000 feet.
-or-
The given value for minorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for spacing must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SetMajorLayoutAsFixedNumber(System.Double,System.Double,System.Double,System.Int32)
Sets the major layout pattern as FixedNumber, while specifying the needed parameters for this pattern.
overallWidth:
The entire width of the wire sheet in the minor direction.
minorStartOverhang:
The distance from the edge of the sheet to the first wire in the minor direction.
minorEndOverhang:
The distance from the last wire to the edge of the sheet in the minor direction.
numberOfWires:
The number of the wires to set in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallWidth is not a number
-or-
The given value for minorStartOverhang is not a number
-or-
The given value for minorEndOverhang is not a number
-or-
numberOfWires must range from 2 to 1000000.
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallWidth must be greater than 0 and no more than 30000 feet.
-or-
The given value for minorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for minorEndOverhang must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SetMajorLayoutAsMaximumSpacing(System.Double,System.Double,System.Double,System.Double)
Sets the major layout pattern as MaximumSpacing, while specifying the needed parameters for this pattern.
overallWidth:
The entire width of the wire sheet in the minor direction.
minorStartOverhang:
The distance from the edge of the sheet to the first wire in the minor direction.
minorEndOverhang:
The distance from the last wire to the edge of the sheet in the minor direction.
spacing:
The distance between the wires in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallWidth is not a number
-or-
The given value for minorStartOverhang is not a number
-or-
The given value for minorEndOverhang is not a number
-or-
The given value for spacing is not a number
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallWidth must be greater than 0 and no more than 30000 feet.
-or-
The given value for minorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for minorEndOverhang must be between 0 and 30000 feet.
-or-
The given value for spacing must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SetMajorLayoutAsActualSpacing(System.Double,System.Double,System.Double)
Sets the major layout pattern as ActualSpacing, while specifying the needed parameters for this pattern.
overallWidth:
The entire width of the wire sheet in the minor direction.
minorStartOverhang:
The distance from the edge of the sheet to the first wire in the minor direction.
spacing:
The distance between the wires in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for overallWidth is not a number
-or-
The given value for minorStartOverhang is not a number
-or-
The given value for spacing is not a number
-or-
The arguments are not consistent, please specify proper input values.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for overallWidth must be greater than 0 and no more than 30000 feet.
-or-
The given value for minorStartOverhang must be between 0 and 30000 feet.
-or-
The given value for spacing must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.IsValidMinorLapSplice(System.Double)
Identifies if the input value is valid to be applied as the minor lap splice
value for this FabricSheetType.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.IsValidMajorLapSplice(System.Double)
Identifies if the input value is valid to be applied as the major lap splice
value for this FabricSheetType.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.GetReinforcementRoundingManager
Returns an object for managing reinforcement rounding override settings.
Returns:
The rounding manager.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.FabricSheetType.CreateDefaultFabricSheetType(Autodesk.Revit.DB.Document)
Creates a new FabricSheetType object with a default name.
ADoc:
The document.
Returns:
The newly created type id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheetType.Material
The id of the material assigned to wires.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The sheetMaterial cannot map to a valid material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorReinforcementArea
The area of fabric divided by the spacing of the wire in the minor direction.
This method does not apply to custom fabric sheet
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorReinforcementArea
The area of fabric divided by the spacing of the wire in the major direction.
This method does not apply to custom fabric sheet
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SheetMassUnit
The sheet mass per area unit.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.SheetMass
The sheet mass.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for sheetMass is not a number
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for sheetMass must be non-negative.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorSpacing
The spacing between the wires in the minor direction (not including the overhangs).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorNumberOfWires
The number of wires used in the minor direction (includes the 1st and last wires).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorLayoutPattern
The layout pattern in the minor direction.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorEndOverhang
The distance from the edge of the sheet to the last wire (measured in the minor direction).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorStartOverhang
The distance from the edge of the sheet to the first wire (measured in the minor direction).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.OverallWidth
The length of the wire sheet (including overhangs) in the minor direction.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorSpacing
The spacing between the wires in the major direction (not including the overhangs).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorNumberOfWires
The number of wires used in the major direction (includes the first and last wires).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorLayoutPattern
The layout pattern in the major direction.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorEndOverhang
The distance from the edge of the sheet to the last wire (measured in the major direction).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorStartOverhang
The distance from the edge of the sheet to the first wire (measured in the major direction).
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.OverallLength
The length of the wire sheet (including overhangs) in the major direction.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorLapSpliceLength
The lap splice length in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: minorLapSpliceLength is greater than the half of the overall width.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorLapSpliceLength
The lap splice length in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: majorLapSpliceLength is greater than the half of the overall length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MinorDirectionWireType
The id of the FabricWireType to be used in the minor direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the ElementId minorDirectionWireType is either invalid or not a FabricWireType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Fabric Sheet Type is Custom
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType.MajorDirectionWireType
The id of the FabricWireType to be used in the major direction.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the ElementId majorDirectionWireType is either invalid or not a FabricWireType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Fabric Sheet Type is Custom
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetType
Represents a fabric sheet type, used in the generation of fabric wires.
Since:
2013